file_rac/processProvider.xml

<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:client="http://xmlns.oracle.com/TrainingSOA/HelloBPELProcess/Process1" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" name="Process1" targetNamespace="http://xmlns.oracle.com/TrainingSOA/HelloBPELProcess/Process1">
<wsdl:documentation>
<abstractWSDL>http://10.252.10.103:7101/soa-infra/services/default/HelloBPELProcess!1.3/WSDLs/Process1.wsdl</abstractWSDL>
</wsdl:documentation>
<plnk:partnerLinkType name="Process1">
<plnk:role name="Process1Provider" portType="client:Process1"/>
</plnk:partnerLinkType>
<wsdl:types>
<schema xmlns="http://www.w3.org/2001/XMLSchema">
<import namespace="http://xmlns.oracle.com/TrainingSOA/HelloBPELProcess/Process1" schemaLocation="http://10.252.10.103:7101/soa-infra/services/default/HelloBPELProcess!1.3*soa_ae5535c0-74b0-4d2b-b676-b777626fdb9b/process1_client_ep?XSD=../Schemas/Process1.xsd"/>
</schema>
</wsdl:types>
<wsdl:message name="Process1RequestMessage">
<wsdl:part name="payload" element="client:process"/>
</wsdl:message>
<wsdl:message name="Process1ResponseMessage">
<wsdl:part name="payload" element="client:processResponse"/>
</wsdl:message>
<wsdl:portType name="Process1">
<wsdl:operation name="process">
<wsdl:input message="client:Process1RequestMessage"/>
<wsdl:output message="client:Process1ResponseMessage"/>
</wsdl:operation>
</wsdl:portType>
<wsdl:binding name="Process1Binding" type="client:Process1">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
<wsdl:operation name="process">
<soap:operation style="document" soapAction="process"/>
<wsdl:input>
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output>
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
</wsdl:binding>
<wsdl:service name="process1_client_ep">
<wsdl:port name="Process1_pt" binding="client:Process1Binding">
<soap:address location="http://10.252.10.103:7101/soa-infra/services/default/HelloBPELProcess!1.3*soa_ae5535c0-74b0-4d2b-b676-b777626fdb9b/process1_client_ep"/>
</wsdl:port>
</wsdl:service>
</wsdl:definitions>